/*	電機四丙 陳忠志 102310121
	2018.10.30
	Homework 7
	實作飯店系統(一) 製作TextUI介面並讀取房間資訊儲存於TextUI的vector<Room> _rooms裡
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------
	電機四丙 陳忠志 102310121
	2018.11.14
	Homework 9
	實作飯店系統(二) 製作BookingSystem管理Hotel及Room，並用TextUI讀取BookingSystem，最重要的是練習pointer的使用方式
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------
	電機四丙 陳忠志 102310121
	2018.12.02
	Homework 11
	實作飯店系統(三) 新增Payment儲存訂單資訊，並增加BookHotel訂房功能
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------
	電機四丙 陳忠志 102310121
	2018.12.20
	Homework 12
	實作飯店系統(四) 練習多型使用方式，將原本的Hotel改為AbstractHotel，並新增Hotel及Motel繼承AbstractHotel
*/

#include "TextUI.h"

int main()
{
	BookingSystem bookingSystem;	// 宣告BookingSystem
	TextUI UI(bookingSystem);		// 宣告TextUI並套用bookingSystem

	UI.Run();	// 執行TextUI介面

	system("pause");
	return 0;
}